prime_count = 0
count = int(input("Введите количество чисел: "))

for i in range(count):
  num = int(input("Введите число: "))

  is_prime = 1

  # число 2 - простое, т.к. все на него делятся с остатком, кроме самого числа и 1
  if num == 2:
    pass
  # число 1 не простое, т.к. у него нет других делителей, кроме самого себя
  # число 0 не простое, т.к. все числа делятся на него без остатка
  elif num <= 1:
     is_prime = 0
  # исключить четные, т.к. есть четные на которые они делятся
  elif num % 2 == 0:
     is_prime = 0
  # иначе
  else:
    # поиск только нечетных делителей до половины числа, кроме 1
    for y in range(3, (num // 2) + 1, 2):
      # исключить, которые делятся без остатка или делитель равен числу
      if num % y == 0 or y == num:
        is_prime = 0
  
  if is_prime == 1:
    prime_count += 1
    print(f"{num} - простое число")

print(f"Количество простых чисел в последовательности: {prime_count}")